Перем юТест;

////////////////////////////////////////////////////////////////////
// Программный интерфейс

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;

	ВсеТесты.Добавить("ТестДолжен_СоздатьЭкземплярСоединения");
//	ВсеТесты.Добавить("ТестДолжен_СоздатьЭкземпляр");

	Возврат ВсеТесты;
	
КонецФункции


Процедура ТестДолжен_СоздатьЭкземплярСоединения() Экспорт

	Соединение = Новый СоединениеRMQ;
	юТест.ПроверитьРавенство(ТипЗнч(Соединение), Тип("СоединениеRMQ"), "Не создался экзепляр Соединение");

	СоединениеEng = Новый ConnectionRMQ;
	юТест.ПроверитьРавенство(ТипЗнч(СоединениеEng), Тип("СоединениеRMQ"), "Не создался экзепляр ENG Соединение");
	
	Соединение.Пользователь = "superrabbit";
	Соединение.Пароль = "strange";
	Соединение.Сервер = "192.168.10.144";
	Соединение.ВиртуальныйХост = "/";
	Клиент = Соединение.Установить();
	Клиент.ОтправитьСтроку("Привет", "test");
	// Приостановить(5000);
	Соединение.Закрыть();

КонецПроцедуры


Процедура ТестДолжен_СоздатьЭкземпляр() Экспорт

	Либа = Новый КлиентRMQ;
	юТест.ПроверитьРавенство(ТипЗнч(Либа), Тип("КлиентRMQ"), "Не создался экзепляр");

	ЛибаEng = Новый RMQClient;
	юТест.ПроверитьРавенство(ТипЗнч(ЛибаEng), Тип("КлиентRMQ"), "Не создался экзепляр ENG");

КонецПроцедуры
