Перем юТест;

////////////////////////////////////////////////////////////////////
// Программный интерфейс

Функция ПолучитьСписокТестов(ЮнитТестирование) Экспорт
	
	юТест = ЮнитТестирование;
	
	ВсеТесты = Новый Массив;

	ВсеТесты.Добавить("ТестДолжен_СоздатьЭкземпляр");

	Возврат ВсеТесты;
	
КонецФункции

Процедура ТестДолжен_СоздатьЭкземпляр() Экспорт

	Либа = Новый КлиентRMQ;
	юТест.ПроверитьРавенство(ТипЗнч(Либа), Тип("КлиентRMQ"), "Не создался экзепляр");

	ЛибаEng = Новый RMQClient;
	юТест.ПроверитьРавенство(ТипЗнч(ЛибаEng), Тип("КлиентRMQ"), "Не создался экзепляр ENG");

КонецПроцедуры
